src/cf/src/AccumulationRegisters/ДвиженияПоКассе/ДвиженияПоКассе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияПоКассе</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипыДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ТипыДвиженияДенежныхСредств/ТипыДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ДвиженияПоКассе/ManagerModule.bsl
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	СуммаДокумента = ДокОбъект.Сумма;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.Касса;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
		Период = ДокОбъект.Дата;
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассы Тогда 
			НС = Движения.ДвиженияПоКассе.Добавить();
			НС.Период = Период;
			НС.Организация = ДокОбъект.Организация;
			НС.МестоХранения = ДокОбъект.КассаИз;
			НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
			НС.ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
			НС.ТипДенежныхСредств = ТипДенежныхСредств;
			//НС.ДокументПродажи = Стр.Основание;
			//НС.ТипНоменклатуры = Стр.ТипНоменклатуры;
			НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
			НС.Сумма = СуммаДокумента;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда	
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.Касса;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
		Период = ДокОбъект.Дата;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда Возврат; КонецЕсли;
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.БанковскийСчёт;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
		Период = ДокОбъект.Дата;
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.Инкассация Тогда 
			НС = Движения.ДвиженияПоКассе.Добавить();
			НС.Период = Период;
			НС.Организация = ДокОбъект.Организация;
			НС.МестоХранения = ДокОбъект.Касса;
			НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
			НС.ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
			НС.ТипДенежныхСредств = Справочники.TypesDePayment.Cash;
			//НС.ДокументПродажи = Стр.Основание;
			//НС.ТипНоменклатуры = Стр.ТипНоменклатуры;
			НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
			НС.Сумма = СуммаДокумента;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда	
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.БанковскийСчёт;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
		Период = ДокОбъект.Дата;
	КонецЕсли;
	// ДвиженияПоКассе
	Для Каждого Стр из ДокОбъект.ТЧОснования Цикл
		Если Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			И Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.НалоговаяНакладная")  
			И Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")  
			И Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда 
			Продолжить;
		КонецЕсли;
		ТЗОснование = ПолучитьТЗПоОснованию(Стр.Основание);
		Для Каждого СтрОснование из ТЗОснование Цикл 
			НС = Движения.ДвиженияПоКассе.Добавить();
			НС.Период = Период;
			НС.Организация = ДокОбъект.Организация;
			НС.МестоХранения = МестоХранения;
			НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
			НС.ТипДвижения = ТипДвижения;
			НС.ТипДенежныхСредств = ТипДенежныхСредств;
			НС.ДокументПродажи = Стр.Основание;
			НС.ТипНоменклатуры = СтрОснование.ТипНоменклатуры;
			НС.ХозяйственнаяОперация = СтрОснование.ХозяйственнаяОперация;
			Если Стр.НомерСтроки = ДокОбъект.ТЧОснования.Количество() и ТЗОснование.Индекс(СтрОснование) = ТЗОснование.Количество()-1 Тогда 
				НС.Сумма = СуммаДокумента;
			Иначе
				НС.Сумма = Окр(стр.Сумма * СтрОснование.Сумма/Стр.Основание.Сумма,2);
			КонецЕсли;
			СуммаДокумента = СуммаДокумента - НС.Сумма;;
		КонецЦикла;
	КонецЦикла;
	Если Не СуммаДокумента = 0 Тогда 
		НС = Движения.ДвиженияПоКассе.Добавить();
		НС.Период = Период;
		НС.Организация = ДокОбъект.Организация;
		НС.МестоХранения = МестоХранения;
		НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
		НС.ТипДвижения = ТипДвижения;
		НС.ТипДенежныхСредств = ТипДенежныхСредств;
		//НС.ДокументПродажи = Стр.Основание;
		//НС.ТипНоменклатуры = Стр.ТипНоменклатуры;
		НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
		НС.Сумма = СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТЗПоОснованию(Док)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТЧТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТЧТовары.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТЧТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	РеализацияТоваровУслугТЧТовары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ТЧТовары КАК РеализацияТоваровУслугТЧТовары
	|ГДЕ
	|	РеализацияТоваровУслугТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТЧУслуги.Ссылка,
	|	РеализацияТоваровУслугТЧУслуги.Ссылка.ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	РеализацияТоваровУслугТЧУслуги.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ТЧУслуги КАК РеализацияТоваровУслугТЧУслуги
	|ГДЕ
	|	РеализацияТоваровУслугТЧУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяТЧТовары.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|	НалоговаяНакладнаяТЧТовары.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяТЧТовары.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладная.ТЧТовары КАК НалоговаяНакладнаяТЧТовары
	|ГДЕ
	|	НалоговаяНакладнаяТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяТЧУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|	НалоговаяНакладнаяТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяТЧУслуги.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладная.ТЧУслуги КАК НалоговаяНакладнаяТЧУслуги
	|ГДЕ
	|	НалоговаяНакладнаяТЧУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка,
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка.ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугТЧТовары.Номенклатура.ТипНоменклатуры,
	|	ПоступлениеТоваровУслугТЧТовары.Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК ПоступлениеТоваровУслугТЧТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧУслуги.Ссылка,
	|	ПоступлениеТоваровУслугТЧУслуги.Ссылка.ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	ПоступлениеТоваровУслугТЧУслуги.Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧУслуги КАК ПоступлениеТоваровУслугТЧУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяПокупкаТЧТовары.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|	НалоговаяНакладнаяПокупкаТЧТовары.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяПокупкаТЧТовары.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧТовары КАК НалоговаяНакладнаяПокупкаТЧТовары
	|ГДЕ
	|	НалоговаяНакладнаяПокупкаТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧУслуги КАК НалоговаяНакладнаяПокупкаТЧУслуги
	|ГДЕ
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТ.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.ХозяйственнаяОперация,
	|	ВТ.ТипНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
